# Sale Analysis

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

In [2]:
df = pd.read_csv('../../data/data.csv', encoding='ISO-8859-1')
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

In [3]:
df.shape

(541909, 8)

In [4]:
df['InvoiceDate'] = df['InvoiceDate'].apply(lambda x: x.replace(year=2022) if x.year == 2010 else x.replace(year=2023) if x.year == 2011 else x)

In [5]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2022-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2022-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2022-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2022-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2022-12-01 08:26:00,3.39,17850.0,United Kingdom

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [7]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [8]:
# Removing the negative quantities from data
df = df[df['Quantity']>0]
df = df[df['UnitPrice']>0]

# Calculating the TotalCost for each product sold
df['TotalPrice'] = df['Quantity'] * df['UnitPrice']

In [9]:
# Seeing as there are many null values in 'CustomerID'column we drop those Null rows

df = df.dropna(subset = ['CustomerID'])
df.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
TotalPrice     0
dtype: int64

In [10]:
df = df.drop_duplicates()

In [11]:
df.describe()

,Quantity,InvoiceDate,UnitPrice,CustomerID,TotalPrice
count,392692.000000,392692,392692.000000,392692.000000,392692.000000
mean,13.119702,2023-07-10 19:13:07.771892224,3.125914,15287.843865,22.631500
min,1.000000,2022-12-01 08:26:00,0.001000,12346.000000,0.001000
25%,2.000000,2023-04-07 11:12:00,1.250000,13955.000000,4.950000
50%,6.000000,2023-07-31 12:02:00,1.950000,15150.000000,12.450000
75%,12.000000,2023-10-20 12:53:00,3.750000,16791.000000,19.800000
max,80995.000000,2023-12-09 12:50:00,8142.750000,18287.000000,168469.600000
std,180.492832,NaN,22.241836,1713.539549,311.099224

In [12]:
products = df['Description'].unique().tolist()
products_df = pd.DataFrame(products, columns=['Product'])
products_df.head()

                               Product
0   WHITE HANGING HEART T-LIGHT HOLDER
1                  WHITE METAL LANTERN
2       CREAM CUPID HEARTS COAT HANGER
3  KNITTED UNION FLAG HOT WATER BOTTLE
4       RED WOOLLY HOTTIE WHITE HEART.

In [13]:
products_df.to_csv('../../data/products.csv', index=False)

In [14]:
countries = df['Country'].unique().tolist()
countries_df = pd.DataFrame(countries, columns=['Country'])
countries_df.head()

          Country
0  United Kingdom
1          France
2       Australia
3     Netherlands
4         Germany

In [15]:
countries_df.to_csv('../../data/countries.csv', index=False)

In [16]:
df.to_csv('../../data/cleaned_data.csv', index=False)